### 基本功能

In [13]:
import pandas as pd
import numpy as np

In [7]:
l = pd.Series(['Huaian', 'BeiJing'], index=['tianyuzhe', 'zhaoran'])
l

tianyuzhe     Huaian
zhaoran      BeiJing
dtype: object

In [8]:
# 重排索引。引入的新索引没有值，所以是 NaN
l = l.reindex(['zhaoran', 'zhangdongmei', 'tianyuzhe', ])
l

zhaoran         BeiJing
zhangdongmei        NaN
tianyuzhe        Huaian
dtype: object

In [10]:
# drop 默认不是就地修改，而是新建一个对象进行修改

l.drop('zhangdongmei')

zhaoran      BeiJing
tianyuzhe     Huaian
dtype: object

In [11]:
# 可以看出 drop 后，l 没有变化
l

zhaoran         BeiJing
zhangdongmei        NaN
tianyuzhe        Huaian
dtype: object

In [17]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                   index = ['Ohio', 'Colorado', 'Utah', 'New york'],
                   columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New york   12   13     14    15

In [18]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [19]:
data[['one', 'three']]

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New york   12     14

In [21]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [23]:
data.iloc[0, [1, 2]]

two      1
three    2
Name: Ohio, dtype: int32

In [24]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New york   12   13     14    15

In [27]:
data.sort_index(axis=1)

          four  one  three  two
Ohio         3    0      2    1
Colorado     7    4      6    5
Utah        11    8     10    9
New york    15   12     14   13

In [28]:
data.index.is_unique

True